Revit 2027 API
ParameterTypeId.ViewportPositioning Property
 "Viewport Positioning"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewportPositioning { get; }
Public Shared ReadOnly Property ViewportPositioning As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewportPositioning {
	ForgeTypeId^ get ();
}
static member ViewportPositioning : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace